# THIS FILE IS AUTOMATICALLY GENERATED
# Project: G:\Documentos\PSoC Creator\PWM_BasicTest01\PWM_BasicTest02.cydsn\PWM_BasicTest02.cyprj
# Date: Fri, 15 Apr 2016 23:05:48 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 40 -waveform {0 20} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {clock_1(fixed-function)} -period 83.333333333333329 -waveform {0 41.6666666666667} [get_pins {ClockBlock/dclk_glb_ff_0}]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for G:\Documentos\PSoC Creator\PWM_BasicTest01\PWM_BasicTest02.cydsn\TopDesign\TopDesign.cysch
# Project: G:\Documentos\PSoC Creator\PWM_BasicTest01\PWM_BasicTest02.cydsn\PWM_BasicTest02.cyprj
# Date: Fri, 15 Apr 2016 23:05:20 GMT
