# THIS FILE IS AUTOMATICALLY GENERATED
# Project: G:\Documentos\PSoC Creator\voltageDisplay_SAR_ADC\VoltageDisplay_SAR_ADC.cydsn\VoltageDisplay_SAR_ADC.cyprj
# Date: Sat, 16 Apr 2016 00:10:36 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 40 -waveform {0 20} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 27.777777777777775 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 27.777777777777775 -waveform {0 13.8888888888889} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyScBoostClk} -period 111.1111111111111 -waveform {0 55.5555555555556} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 7} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {clock_1(fixed-function)} -period 83.333333333333329 -waveform {0 27.7777777777778} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 51} -nominal_period 720 [list [get_pins {ClockBlock/aclk_glb_1}]]
create_clock -name {ADC_theACLK(fixed-function)} -period 694.44444444444434 -waveform {0 360} -nominal_period 720 [get_pins {ClockBlock/aclk_glb_ff_1}]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for G:\Documentos\PSoC Creator\voltageDisplay_SAR_ADC\VoltageDisplay_SAR_ADC.cydsn\TopDesign\TopDesign.cysch
# Project: G:\Documentos\PSoC Creator\voltageDisplay_SAR_ADC\VoltageDisplay_SAR_ADC.cydsn\VoltageDisplay_SAR_ADC.cyprj
# Date: Sat, 16 Apr 2016 00:10:17 GMT
